#
# 3일차
#
# 0. OPEN
# 1. Review
# 2. Topic
#   2.1 List (숫자 문자 이런 거 합쳐서 복합적으로 할 수 있는)
#   2.2 factor (범주형, 카테고리형) ex) 혈액형 정해져있는 항목 정리하는.
#   2.3 matrix 
#   2.4 data frame (실제로 가장 많이 쓰게 되는)
#   2.5 파일 읽기/쓰기
# 3. Q & A
# 4. Next
# 5. Close
#
#
# 德 有隣 必
#
# r을 공부하는 것은 함수에 익어지는 것.
# 함수는 제공되어 있는 것, 이것을 어떻게 이용할 것인지에 관하여.
#

#
# &와 &&와, |와 ||의 차이
#

vt <- c( TRUE, FALSE)
vt2 <-  c( TRUE, FALSE)

vt & vt2             # 벡터별 요소 각각에 대하여 AND 연산 수행
vt && vt2            # 벡터 첫번째 요소에 대하여 AND 연산 수행



#
# ()와 []의 차이
#
# () : 1. 연산식에서 우선순위 변경 목적 2. 함수에서 인수전달
#
# 모든 인수엔 반드시 괄호가가 있어야
#
# [] : 벡터, 리스트, 매트릭스, 데이터프레임에서 요소를 지정하는 목적













